Repository: psytrap/Marveluzz-UI
Catalog: docs/locales/*/LC_MESSAGES/index.po
Languages: fa

source: Manual
fa: کتابچه راهنما

source: Implement Doc
fa: مستندات پیاده سازی

source: PyWebIO provides a diverse set of imperative functions to obtain user input and output content on the browser, turning the browser into a "rich text terminal", and can be used to build simple web applications or browser-based GUI applications. Using PyWebIO, developers can write applications just like writing terminal scripts (interaction based on input and print function), without the need to have knowledge of HTML and JS. PyWebIO is ideal for quickly building interactive applications that don't require a complicated user interface.
fa: PyWebIO مجموعه ای از توابع دستوری را برای به دست آوردن ورودی کاربر و خروجی دادن محتوا روی مرورگر را ارائه می کند، تبدیل مرورگر به یک «ترمینال متن غنی»، و می تواند برای ساخت وب اپلیکیشن های ساده یا اپلیکیشن های دارای رابط کاربری گرافیکی مبتنی بر مرورگر استفاده شود. با استفاده از PyWebIO، توسعه دهندگان می توانند اپلیکیشن ها را درست مثل نوشتن اسکریپت های ترمینال (تعامل بر پایه تابع Input و Print) بنویسند، بدون نیاز به داشتن دانش HTML و جاوا اسکریپت. PyWebIO برای ساخت سریع اپلیکیشن های تعاملی که یک رابط کاربری پیچیده نیاز ندارند ایده آل است.

source: Features
fa: ویژگی ها

source: Use synchronization instead of callback-based method to get input
fa: استفاده از همگام سازی بجای متد مبتنی بر فراخوانی برای دریافت ورودی

source: Non-declarative layout, simple and efficient
fa: چیدمان Non-declarative، ساده و کارآمد

source: Less intrusive: old script code can be transformed into a Web service only by modifying the input and output operation
fa: کمتر مزاحم: کد اسکریپت قدیم می تواند به یک وب سرویس تبدیل شود فقط با اصلاح عملیات ورودی و خروجی

source: Support integration into existing web services, currently supports Flask, Django, Tornado, aiohttp and FastAPI(Starlette) framework
fa: پشتیبانی از ادغام با وب سرویس های موجود، در حال حاضر پشتیبانی از Flask, Django, Tornado, aiohttp و فریم ورک FastAPI(Starlette)

source: Support for ``asyncio`` and coroutine
fa: پشتیبانی برای ``asyncio`` و coroutine

source: Support data visualization with third-party libraries
fa: پشتیبانی از بصری سازی داده با کتابخانه های شخص ثالث

source: Installation
fa: نصب

source: Stable version::
fa: نسخه پایدار::

source: Development version::
fa: نسخه توسعه::

source: **Prerequisites**: PyWebIO requires Python 3.5.2 or newer
fa: **پیش نیاز ها**: PyWebIO به Python 3.5.2 یا جدید تر نیاز دارد

source: Hello, world
fa: سلام، دنیا

source: Here is a simple PyWebIO script to calculate the `BMI <https://en.wikipedia.org/wiki/Body_mass_index>`_ ::
fa: در اینجا یک اسکریپت PyWebIO ساده برای محاسبه `شاخص توده بدنی <https://en.wikipedia.org/wiki/Body_mass_index>`_ آورده شده است::

source: # A simple script to calculate BMI from pywebio.input import input, FLOAT from pywebio.output import put_text def bmi(): height = input("Input your height(cm)：", type=FLOAT) weight = input("Input your weight(kg)：", type=FLOAT) BMI = weight / (height / 100) ** 2 top_status = [(16, 'Severely underweight'), (18.5, 'Underweight'), (25, 'Normal'), (30, 'Overweight'), (35, 'Moderately obese'), (float('inf'), 'Severely obese')] for top, status in top_status: if BMI <= top: put_text('Your BMI: %.1f. Category: %s' % (BMI, status)) break if __name__ == '__main__': bmi()
fa: # یک اسکریپت ساده برای محاسبه شاخص توده بدنی from pywebio.input import input, FLOAT from pywebio.output import put_text def bmi(): height = input("قد خود را وارد کنید(سانتی متر)：", type=FLOAT) weight = input("وزن خود را وارد کنید(کیلوگرم)：", type=FLOAT) BMI = weight / (height / 100) ** 2 top_status = [(16, 'کمبود وزن شدید'), (18.5, 'کمبود وزن'), (25, 'عادی'), (30, 'اضافه وزن'), (35, 'چاق متوسط'), (float('inf'), 'چاق شدید')] for top, status in top_status: if BMI <= top: put_text('شاخص توده بدنی شما: %.1f. دسته بندی: %s' % (BMI, status)) break if __name__ == '__main__': bmi()

source: This is just a very simple script if you ignore PyWebIO, but after using the input and output functions provided by PyWebIO, you can interact with the code in the browser:
fa: این فقط یک اسکریپت خیلی ساده است اگه شما PyWebIO را نادیده بگیرید، اما بعد از استفاده از توابع ورودی و خروجی ارائه شده توسط PyWebIO، شما می توانید با کد در مرورگر تعامل برقرار کنید:

source: In the last line of the above code, changing the function call ``bmi()`` to `pywebio.start_server(bmi, port=80) <pywebio.platform.tornado.start_server>` will start a bmi web service on port 80 ( :demo_host:`online Demo </bmi>` ).
fa: در آخرین خط کد بالا، تغییر فراخوانی تابع ``bmi()`` به `pywebio.start_server(bmi, port=80) <pywebio.platform.tornado.start_server>` یک وب سرویس شاخص توده بدنی را روی پورت 80 راه اندازی می کند ( :demo_host:`دمو آنلاین </bmi>` ).

source: If you want to integrate the ``bmi()`` service into an existing web framework, you can visit :ref:`Integration with a web framework <integration_web_framework>` section of this document.
fa: اگر شما می خواهید که سرویس ``bmi()`` را با یک وب فریم ورک موجود ادغام کنید، می توانید بخش :ref:`Integration with a web framework <integration_web_framework>` این مستندات را ببینید.

source: Documentation
fa: مستندات

source: This documentation is also available in `PDF and Epub formats <https://readthedocs.org/projects/pywebio/downloads/>`_.
fa: این مستندات همچنین در `فرمت های PDF و Epub <https://readthedocs.org/projects/pywebio/downloads/>`_ در دسترس است.

source: Indices and tables
fa: ایندکس ها و جداول

source: Discussion and support
fa: بحث و پشتیبانی

source: Need help when use PyWebIO? Make a new discussion on `Github Discussions <https://github.com/wang0618/PyWebIO/discussions>`_.
fa: هنگام استفاده از PyWebIO نیاز به کمک دارید؟ یک بحث جدید در `Github Discussions <https://github.com/wang0618/PyWebIO/discussions>`_ بسازید.

source: Report bugs on the `GitHub issue <https://github.com/wang0618/pywebio/issues>`_.
fa: باگ ها را در `GitHub issue <https://github.com/wang0618/pywebio/issues>`_ گزارش کنید.
